:PROPERTIES:
- org-mode configuration
#+TITLE: ASA SM1ST method comparison and RRF adjustment
#+AUTHOR:    Emiliy Desmoreaux, Brittany Wong, Nate McIntosh, Matthew Henderson
#+DATE:      \today
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:
#+DRAWERS: LOGBOOK CLOCK HIDDEN PROPERTIES
#+STARTUP: overview
#+Latex_class: koma-article
#+LaTeX_header: \usepackage{textpos}
#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{longtable}
#+LaTeX_HEADER: \usepackage[automark, autooneside=false, headsepline]{scrlayer-scrpage}
#+LaTeX_HEADER: \clearpairofpagestyles
#+LaTeX_HEADER: \ihead{\leftmark}% section on the inner (oneside: right) side
#+LaTeX_HEADER: \ohead{\rightmark}% subsection on the outer (oneside: left) side
#+LaTeX_HEADER: \ofoot*{\pagemark}% the pagenumber on the outer side of the foot, also on plain pages
#+LaTeX_HEADER: \pagestyle{scrheadings}
:END:


* COMMENT Summary 

- SUAC concentrations are at the low end of the analytical range in the newborn population
  - Results from the SM1ST method are slightly higher in the population
    due to background signal (Figure [[fig:popdens]] and Table
    \ref{tab:summary})
- The low concentration population data can not be used to access the SM1ST and AAAAC comparison 
- The reported CDC mean values were selected as the source of truth
  for this method and results were aligned with the CDC mean values
  (Figure [[fig:suac_cdc]])
- Linearity materials, calibrators,EQA material and one elevated
  patient sample were used to assess comparability to the AAAC method
  after adjustment to align with CDC means (Figure [[fig:comp]])
- This linear regression model was used to transfer the current SUAC
  screening threshold to SM1ST assay
- A Monte Carlo simulation was used to estimate the number initial
  screen positive result per week for a set of potential screening
  cut-offs (Table \ref{tab:sim})
  - An initial screening cut-off of 3.0 uM would result in approximately
    one initial positive result per week with a maximum of 5.
  - This is equivalent to a value of 6.2 uM  on the AAAC assay.
- Short term follow-up data shows that all true positive tyrosinemia
  type 1 cases had a SUAC \gt 20 uM this would be equivalent to a
  result \gt 8.6 uM on the SM1ST assay
  - Based on this evidence we will use an alert threshold of 7 umol/L

- Based on the method comparison data, simulation of initial positive
  rate and review of screen positive cases we will use the following
  first tier screening cut-offs:

  - Initial positive :: 3 umol/L
  - Alert positive :: 7 umol/L





* Population data 
- using ASA-D3 as the IS 

#+begin_src R :session *R* :results output :exports results :tangle yes
  ## CDC adjustment
  ## ASA
  bill_asapop <- get_data("ASA", 20, query_population)
  bill_asalin <- get_data("ASA", 20, query_linearity)
  bill_asalin_distinct <- bill_asalin %>%
      distinct(date, sample, sm1st, .keep_all = TRUE) 

  bill_asaqc <- get_viewdata("ASA", query_qc)
  bill_asamoi <- get_viewdata("ASA", query_moi)

  larry_asapop <- get_csv_data("ASA", 20, "Larry", pop_csv_query)
  larry_asalin <- get_csv_data("ASA", 20, "Larry", linearity_csv_query)
  larry_asalin_distinct <- larry_asalin %>%
      distinct(date, sample, sm1st, .keep_all = TRUE) 
  larry_asaqc <- get_csv_viewdata("ASA", "Larry", qc_csv_query)
  larry_asamoi <- get_csv_viewdata("ASA", "Larry", moi_csv_query)

  joe_asapop <- get_csv_data("ASA", 20, "Joe", pop_csv_query)
  joe_asalin <- get_csv_data("ASA", 20, "Joe", linearity_csv_query)
  joe_asalin_distinct <- joe_asalin %>%
      distinct(date, sample, sm1st, .keep_all = TRUE) 
  joe_asaqc <- get_csv_viewdata("ASA", "Joe", qc_csv_query)
  joe_asamoi <- get_csv_viewdata("ASA", "Joe", moi_csv_query)

#+end_src


#+begin_src R :session *R* :results output graphics file :file ../figures/Bill/asa_dens.pdf :exports results :tangle yes
  ggplot(bill_asapop) +
    geom_density(aes(x = aaac, colour = aaac_instrument)) +
    geom_density(aes(x = sm1st)) +
    coord_cartesian(xlim = c(0,20))
#+end_src

#+CAPTION[]: Bill ASA distribution in population by assay and instrument 
#+NAME: fig:popdens
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/Bill/asa_dens.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/Larry/asa_dens.pdf :exports results :tangle yes
  ggplot(larry_asapop) +
    geom_density(aes(x = aaac, colour = aaac_instrument)) +
    geom_density(aes(x = sm1st)) +
    coord_cartesian(xlim = c(0,20))
#+end_src

#+CAPTION[]: Larry ASA distribution in population by assay and instrument 
#+NAME: fig:popdens
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/Larry/asa_dens.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/Joe/asa_dens.pdf :exports results :tangle yes
  ggplot(joe_asapop) +
    geom_density(aes(x = aaac, colour = aaac_instrument)) +
    geom_density(aes(x = sm1st)) +
    coord_cartesian(xlim = c(0,20))
#+end_src

#+CAPTION[]: Joe ASA distribution in population by assay and instrument 
#+NAME: fig:popdens
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/Joe/asa_dens.pdf]]



#+begin_src R :session *R* :results output :exports results :tangle yes
  ### CDC mean value
  larry_rrf <- 1 #make_cdc(larry_asalin_distinct, cdc_data, "Larry", "ASA")
  bill_rrf <- 1 #make_cdc(bill_asalin_distinct, cdc_data, "Bill", "ASA")
  joe_rrf <- 1 #make_cdc(joe_asalin_distinct, cdc_data, "Joe", "ASA")

  make_plots("ASA_CDC", bill_asapop, bill_asalin, bill_rrf, 4, 10 , "Bill")
  make_ts("ASA_CDC", bill_asaqc, bill_asamoi, bill_rrf, "Bill")
  make_mcr("ASA", bill_asapop, bill_asalin, bill_asaqc, c("ASA" = bill_rrf), "Bill")

  make_plots("ASA_CDC", joe_asapop, joe_asalin, joe_rrf, 4, 10, "Joe")
  make_ts("ASA_CDC", joe_asaqc, joe_asamoi, joe_rrf, "Joe")
  make_mcr("ASA", joe_asapop, joe_asalin, joe_asaqc, c("ASA" = joe_rrf), "Joe")

  make_plots("ASA_CDC", larry_asapop, larry_asalin, larry_rrf, 4, 10, "Larry")
  make_ts("ASA_CDC", larry_asaqc, larry_asamoi, larry_rrf, "Larry")
  make_mcr("ASA", larry_asapop, larry_asalin, larry_asaqc, c("ASA" = larry_rrf), "Larry")

#+end_src


** Bill
#+CAPTION[]:Bill ASA CDC and linearity based RRF adjustment
#+NAME: fig:ASA_CDC_pop
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Bill/ASA_CDC.pdf]]

\clearpage

#+CAPTION[]:Bill ASA QC and MOI comparison with CDC based RRF adjustment
#+NAME: fig:ASA_CDC_qc
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Bill/ASA_CDC_ts.pdf]]


#+CAPTION[]:Bill ASA SM1ST and AAAC regression after RRF adjustment
#+NAME: fig:ASA_reg
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Bill/ASA_regression.pdf]]

\clearpage


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  bill_asapop$sm1st_rrf <- bill_asapop$sm1st * bill_rrf
  stargazer(bill_asapop, title = "Bill Summary statistics", label = "tab:bill_summary")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Tue, Sep 16, 2025 - 04:57:43 PM
\begin{table}[!htbp] \centering 
  \caption{Bill Summary statistics} 
  \label{tab:bill_summary} 
\begin{tabular}{@{\extracolsep{5pt}}lccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
Statistic & \multicolumn{1}{c}{N} & \multicolumn{1}{c}{Mean} & \multicolumn{1}{c}{St. Dev.} & \multicolumn{1}{c}{Min} & \multicolumn{1}{c}{Max} \\ 
\hline \\[-1.8ex] 
sm1st & 10,168 & 8.120 & 3.727 & 0.400 & 20.000 \\ 
aaac & 10,168 & 0.566 & 0.296 & 0.000 & 6.900 \\ 
sm1st\_rrf & 10,168 & 8.120 & 3.727 & 0.400 & 20.000 \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export


** Larry

#+CAPTION[]:Larry ASA CDC and linearity based RRF adjustment
#+NAME: fig:ASA_CDC_pop
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Larry/ASA_CDC.pdf]]

\clearpage

#+CAPTION[]:Larry ASA QC and MOI comparison with CDC based RRF adjustment
#+NAME: fig:ASA_CDC_qc
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Larry/ASA_CDC_ts.pdf]]


#+CAPTION[]:Larry ASA SM1ST and AAAC regression after RRF adjustment
#+NAME: fig:ASA_reg
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Larry/ASA_regression.pdf]]


\clearpage


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  larry_asapop$sm1st_rrf <- larry_asapop$sm1st * larry_rrf
  stargazer(larry_asapop, title = "Larry Summary statistics", label = "tab:larry_summary")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Tue, Sep 16, 2025 - 04:57:54 PM
\begin{table}[!htbp] \centering 
  \caption{Larry Summary statistics} 
  \label{tab:larry_summary} 
\begin{tabular}{@{\extracolsep{5pt}}lccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
Statistic & \multicolumn{1}{c}{N} & \multicolumn{1}{c}{Mean} & \multicolumn{1}{c}{St. Dev.} & \multicolumn{1}{c}{Min} & \multicolumn{1}{c}{Max} \\ 
\hline \\[-1.8ex] 
sm1st & 1,707 & 9.689 & 3.518 & 0.157 & 20.000 \\ 
aaac & 1,707 & 0.552 & 0.173 & 0.100 & 1.700 \\ 
sm1st\_rrf & 1,707 & 9.689 & 3.518 & 0.157 & 20.000 \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export

** Joe

#+CAPTION[]:Joe ASA CDC and linearity based RRF adjustment
#+NAME: fig:ASA_CDC_pop
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Joe/ASA_CDC.pdf]]

\clearpage

#+CAPTION[]:Joe ASA QC and MOI comparison with CDC based RRF adjustment
#+NAME: fig:ASA_CDC_qc
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Joe/ASA_CDC_ts.pdf]]

#+CAPTION[]:Joe ASA SM1ST and AAAC regression after RRF adjustment
#+NAME: fig:ASA_reg
#+ATTR_LaTeX: :width 1\textwidth
[[file:../figures/Joe/ASA_regression.pdf]]

\clearpage


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  joe_asapop$sm1st_rrf <- joe_asapop$sm1st * joe_rrf
  stargazer(joe_asapop, title = "Joe Summary statistics", label = "tab:joe_summary")
#+end_src

#+RESULTS:
#+begin_export latex

% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Tue, Sep 16, 2025 - 04:57:59 PM
\begin{table}[!htbp] \centering 
  \caption{Joe Summary statistics} 
  \label{tab:joe_summary} 
\begin{tabular}{@{\extracolsep{5pt}}lccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
Statistic & \multicolumn{1}{c}{N} & \multicolumn{1}{c}{Mean} & \multicolumn{1}{c}{St. Dev.} & \multicolumn{1}{c}{Min} & \multicolumn{1}{c}{Max} \\ 
\hline \\[-1.8ex] 
sm1st & 1,245 & 7.761 & 2.469 & 0.321 & 19.990 \\ 
aaac & 1,245 & 0.642 & 0.240 & 0.000 & 2.000 \\ 
sm1st\_rrf & 1,245 & 7.761 & 2.469 & 0.321 & 19.990 \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export



* Internal Standard Analysis  

#+begin_src R :session *R* :results output :exports results :tangle yes
       library("tidyverse")
       library("readxl")
      library("mcr")
      library("stargazer")
       source("./functions.r")
       source("./queries.r")
       options(warn=-1) # 0 to turn on again
       options(dplyr.summarise.inform = FALSE)

  bill_int_query <- "select date(createdate) as date, instrument, plate, well, sample, analyte, result from sm1st 
	  where analyte in ('Arg IS INT', 'ASA INT', 'Asa IS Int', 'Asa[-H2O] Int', 'Asa[-H2O] IS Int', 'Cit IS INT', 'Cit')
	  and date(createdate) > '2025-06-01'"

  bill_int <- with_con(bill_int_query, params = c()) %>%
	 select(date, instrument, plate, well, sample, analyte, result) %>%
	  pivot_wider(id_cols = c(date, instrument, plate, well, sample),names_from = analyte, values_from = result) %>%
	 rename(arg_is = `Arg IS INT`, asa_is = `Asa IS Int`, asa = `ASA INT`,
		asa_h2o_is = `Asa[-H2O] IS Int`, asa_h2o = `Asa[-H2O] Int`, cit_is = `Cit IS INT`, cit = Cit) %>%
	 select(-well)


  csv_int_query <- "select createdate as date, instrument, plate, sample, ARG_IS_INT, ASA_INT, ASA_IS_INT,
  ASA_H2O_INT, ASA_H2O_IS_INT, Cit, CIT_IS_INT from csv"


  csv_int <- with_con(csv_int_query, params = c()) %>%
    rename(arg_is = arg_is_int, asa_is = asa_is_int, asa = asa_int, asa_h2o_is = asa_h2o_is_int,
	   asa_h2o = asa_h2o_int, cit = cit,  cit_is = cit_is_int)


    d <- 16.13 ## dilution factor 
    asa_is_c <- 1
    arg_is_c <- 5
    cit_is_c <- 5


    merge_int <- rbind(bill_int, csv_int) %>%
      transform(asa_r = asa/asa_is * d * asa_is_rrf,
		asa_h2o_r = asa_h2o/asa_h2o_is * d * asa_is_c,
		asa_t_r = (asa + asa_h2o)/(asa_is +asa_h2o_is) * d * asa_is_c,
		asa_arg_r= asa/arg_is * d * 5 * arg_is_c,
		asa_t_arg_r= (asa + asa_h2o)/arg_is * d * arg_is_c,
		asa_cit_r= asa/cit_is * d * cit_is_c,
		asa_t_cit_r= (asa + asa_h2o)/cit_is * d * cit_is_c)

#+end_src  

#+RESULTS:


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_IS_ts.pdf :exports results :tangle yes
  merge_int %>%
    pivot_longer(cols= -c(date, instrument, plate,sample), names_to = "analyte", values_to = "result") %>%
    filter(analyte %in% c("asa", "asa_is", "asa_h2o", "asa_h2o_is")) %>%
    group_by(date, instrument, plate, analyte) %>%
    summarize(median = median(result, na.rmp = TRUE),
	      sd = sd(result, na.rm = TRUE)) %>%
    gather(key = center, value = value , median:sd) %>%
    ggplot(aes(x = date)) +
    geom_jitter(aes(y = value, colour = analyte, shape = center),alpha =  0.5 , size = 2) +
    geom_hline(yintercept = 5000, colour = "red", linetype = "dashed") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
    ylab("Intensity") +
    xlab("Date") +
    facet_grid(rows = vars(instrument), scales = "free")
#+end_src

#+CAPTION[]: ASA IS variability 
#+NAME: fig:asa_is
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_IS_ts.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/Arg_Cit_IS.pdf :exports results :tangle yes
 merge_int %>%
    pivot_longer(cols= -c(date, instrument, plate,sample), names_to = "analyte", values_to = "result") %>%
    filter(analyte %in% c("arg_is", "cit_is")) %>%
    group_by(date, instrument, plate, analyte) %>%
    summarize(median = median(result, na.rmp = TRUE),
	      sd = sd(result, na.rm = TRUE)) %>%
    gather(key = center, value = value , median:sd) %>%
    ggplot(aes(x = date)) +
    geom_point(aes(y = value, colour = analyte, shape = center),alpha =  0.5 , size = 2) +
    geom_hline(yintercept = 500000, colour = "red", linetype = "dashed") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
    ylab("Intensity") +
    xlab("Date") +
    facet_grid(rows = vars(instrument), scales = "free")
  
#+end_src

#+CAPTION[]: Arg and Cit  IS variability 
#+NAME: fig:asa_is
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/Arg_Cit_IS.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_IS_options.pdf :exports results :tangle yes

  merge_int %>%
    select(date, instrument, plate, sample, asa_t_cit_r, asa_cit_r, asa_t_arg_r, asa_arg_r, asa_r, asa_h2o_r, asa_t_r) %>%
    filter(str_detect(sample, "N")) %>%
    pivot_longer(cols = -c(date, instrument, plate,sample), names_to = "analyte", values_to = "result") %>%
    group_by(date, instrument, plate, analyte) %>%
    summarize(median = median(result, na.rm = TRUE),
		sd = sd(result, na.rm = TRUE)) %>%
    gather(key = center , value = value , median:sd) %>%        
    ggplot(aes(x = date)) +
    geom_jitter(aes(y = value, colour = analyte, shape = center), alpha = 0.5, size = 2) +
    geom_hline(yintercept = 10, colour = "red", linetype = "dashed") +
    ylab("Intensity") +
    xlab("Date") +
    facet_grid(rows = vars(instrument), scales = "free")
  coord_cartesian(ylim = c(0, 50)) +


#+end_src

#+CAPTION[]:ASA IS options - NBS samples
#+NAME: fig:asa_is
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_IS_options.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_IS_options_bp.pdf :exports results :tangle yes

  merge_int %>%
    select(date, instrument, plate, sample, asa_t_cit_r, asa_t_arg_r, asa_t_r) %>%
    filter(str_detect(sample, "N")) %>%
    pivot_longer(cols = -c(date, instrument, plate,sample), names_to = "analyte", values_to = "result") %>%
    transform(week = as.factor(week(date))) %>%
    ggplot(aes(x = week, y = result, colour = analyte)) +
    geom_boxplot() +
    geom_hline(yintercept = 10, colour = "red", linetype = "dashed") +
    ylab("Intensity") +
    xlab("Week") +
    facet_grid(rows = vars(instrument), scales = "free") +
    coord_cartesian(ylim = c(0, 50)) 

#+end_src

#+CAPTION[]: ASA IS options - NBS samples
#+NAME: fig:asa_is
#+ATTR_LaTeX: :wpidth 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_IS_options_bp.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_QC_IS_options.pdf :exports results :tangle yes
  merge_int %>%
    filter(str_detect(sample, "SM1-") & date > "2025-08-21") %>%
    select(date, instrument, plate, sample, asa_t_cit_r, asa_t_arg_r,  asa_t_r) %>%
    pivot_longer(cols = -c(date, instrument, plate, sample), names_to = "analyte", values_to = "result") %>%
    ggplot() +
    geom_boxplot(aes(x = sample, y = result,  colour = analyte)) +
    facet_grid(rows = vars(instrument), scales = "free") +
    theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
    coord_cartesian(ylim = c(0,50))
#+end_src

#+CAPTION[]: ASA IS options - QC samples
#+NAME: fig:asa_is
#+ATTR_LaTeX: :wpidth 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_QC_IS_options.pdf]]



\clearpage 

* CDC Comparison

#+begin_src R :session *R* :results output :exports results :tangle yes
  cdc_data <- read.csv(file = "../data/ASA_CDClin.csv")

  asa_linearity <- merge_int %>%
      filter(str_detect(sample, "SM1-CDCLin") & date > "2025-08-21") %>%
      select(date, instrument, plate, sample, asa_t_cit_r, asa_t_arg_r,  asa_t_r) %>%
      left_join(cdc_data, by= "sample")

#+end_src

#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_CDC_scatter.pdf :exports results :tangle yes
  ggplot(asa_linearity, aes(x = spike, y = asa_t_r, colour = instrument)) +
    geom_point()+
    geom_smooth(method = "lm") +
    geom_abline(slope = 1, intercept = 0, colour = "red", linetype = "dashed")

#+end_src


#+CAPTION[]: CDC comparison with ASA IS
#+NAME: fig:
#+ATTR_LaTeX: :width 0.9\textwidth
[[file:./figures/]]



#+RESULTS:
[[file:../figures/ASA_CDC_scatter.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_cit_is_CDC_scatter.pdf :exports results :tangle yes
  ggplot(asa_linearity, aes(x = spike, y = asa_t_cit_r, colour = instrument)) +
    geom_point()+
    geom_smooth(method = "lm") +
    geom_abline(slope = 1, intercept = 0, colour = "red", linetype = "dashed")

#+end_src

#+CAPTION[]: CDC comparison with Cit IS
#+NAME: fig:
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_cit_is_CDC_scatter.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/ASA_arg_is_CDC_scatter.pdf :exports results :tangle yes
  ggplot(asa_linearity, aes(x = spike, y = asa_t_arg_r, colour = instrument)) +
    geom_point()+
    geom_smooth(method = "lm") +
    geom_abline(slope = 1, intercept = 0, colour = "red", linetype = "dashed")
#+end_src

#+CAPTION[]: CDC comparison with Arg IS
#+NAME: fig:
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/ASA_arg_is_CDC_scatter.pdf]]


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  bill_asa_linearity <- asa_linearity %>%
    filter(instrument == "Bill")

  model <- lm(asa_t_r ~ spike , data = bill_asa_linearity)
  slope = model$coefficients[['spike']]
  bill_asa_is_rrf = 1/slope

  model <- lm(asa_t_arg_r ~ spike , data = bill_asa_linearity)
  slope = model$coefficients[['spike']]
  bill_arg_is_rrf = 1/slope

  model <- lm(asa_t_cit_r ~ spike , data = bill_asa_linearity)
  slope = model$coefficients[['spike']]
  bill_cit_is_rrf = 1/slope

  joe_asa_linearity <- asa_linearity %>%
    filter(instrument == "Joe")

  model <- lm(asa_t_r ~ spike , data = joe_asa_linearity)
  slope = model$coefficients[['spike']]
  joe_asa_is_rrf = 1/slope

  model <- lm(asa_t_arg_r ~ spike , data = joe_asa_linearity)
  slope = model$coefficients[['spike']]
  joe_arg_is_rrf = 1/slope

  model <- lm(asa_t_cit_r ~ spike , data = joe_asa_linearity)
  slope = model$coefficients[['spike']]
  joe_cit_is_rrf = 1/slope


  larry_asa_linearity <- asa_linearity %>%
    filter(instrument == "Larry")

  model <- lm(asa_t_r ~ spike , data = larry_asa_linearity)
  slope = model$coefficients[['spike']]
  larry_asa_is_rrf = 1/slope

  model <- lm(asa_t_arg_r ~ spike , data = larry_asa_linearity)
  slope = model$coefficients[['spike']]
  larry_arg_is_rrf = 1/slope

n  model <- lm(asa_t_cit_r ~ spike , data = larry_asa_linearity)
  slope = model$coefficients[['spike']]
  larry_cit_is_rrf = 1/slope

 cit_rrf <- data.frame(instrument = c("Bill", "Larry", "Joe"),
			   rrf = c(bill_cit_is_rrf/2, larry_cit_is_rrf/2, joe_cit_is_rrf/2))

  adjusted_linearity <- asa_linearity %>%
    left_join(cit_rrf,  by= "instrument") %>%
    transform(asa_adjusted = asa_t_cit_r * rrf)

   adjusted_merge_int <- merge_int %>%
     filter(str_detect(sample, "N")) %>%
     left_join(cit_rrf, by= "instrument") %>%
     transform(asa_adjusted = asa_t_cit_r * rrf)

#+end_src

#+RESULTS:
#+begin_export latex
#+end_export


#+begin_src R :session *R* :results output graphics file :file ../figures/adjusted_ASA_cit_is_CDC_scatter.pdf :exports results :tangle yes
  ggplot(adjusted_linearity, aes(x = spike, y = asa_adjusted, colour = instrument)) +
    geom_point()+
    geom_smooth(method = "lm") +
    geom_abline(slope = 1, intercept = 0, colour = "red", linetype = "dashed")
#+end_src

#+CAPTION[]: CDC comparison with Arg IS
#+NAME: fig:
#+ATTR_LaTeX: :width 0.9\textwidth
#+RESULTS:
[[file:../figures/adjusted_ASA_cit_is_CDC_scatter.pdf]]


#+begin_src R :session *R* :results output graphics file :file ../figures/adjusted_ASA_ts.pdf :exports results :tangle yes
  adjusted_merge_int %>%
    pivot_longer(cols= -c(date, instrument, plate,sample), names_to = "analyte", values_to = "result") %>%
    filter(analyte == "asa_adjusted" ) %>%
      group_by(date, instrument, plate, analyte) %>%
      summarize(median = median(result, na.rmp = TRUE),
		sd = sd(result, na.rm = TRUE)) %>%
      gather(key = center, value = value , median:sd) %>%
      ggplot(aes(x = date)) +
      geom_jitter(aes(y = value, colour = analyte, shape = center),alpha =  0.5 , size = 2) +
      geom_hline(yintercept = 10, colour = "red", linetype = "dashed") +
      theme(axis.text.x = element_text(angle = 90, vjust = 0.5, hjust=1)) +
      ylab("Intensity") +
      xlab("Date") +
      facet_grid(rows = vars(instrument), scales = "free") +
      coord_cartesian(ylim = c(0,25))
#+end_src

#+RESULTS:
[[file:../figures/adjusted_ASA_ts.pdf]]


* COMMENT Simulation

- The intention of this simulation is to determine the impact of potential first tier ASA thresholds
- Inputs:
  - Weekly NBS sample volume: Sampled from a normal distribution with mean 2840
    and SD 297
    - Based on weekly volumes 2020-01-01 to 2021-12-31
  - ASA screening thresholds ranging from 2.5 (equivalent to 5 with AAAC) to 5 (equivalent to 10 with AAAC) 
- Method:
  - The ASA  population data (n ~ 12,000) was sampled 1000 times
    - The size of the weekly population sample was derived from a
      normal distribution with mean 2840 and SD 297
  - The ASA threshold applied was varied from 2.5 to 3.0 in increments
    of 0.1 for each population sample
    - The ASA logic using the current threshold was applied to each
      result in the population sample.
  - The number of results \ge the threshold for each data sample was recorded


#+begin_src R :session *R* :results output :exports results :tangle yes
    ###### weekly volumes
    ## volume$date_time  <- ymd_hms(volume$DateTime)
    ##   volume$nbs_entered_today<- as.numeric(volume$NBSEnteredToday)

    ##   volume_week <- volume %>%
    ## 	  group_by(week = date(floor_date(date_time, unit = "week"))) %>%
    ## 	  summarise(sum = sum(nbs_entered_today)) %>%
    ## 	  filter(week >= "2020-01-01" & week <= "2021-12-31") ## Two years

    ##   ggplot(volume_week) +
    ##     geom_histogram(aes(x=sum), binwidth = 100)

    start <- 10
    end <- 30
    mean_volume= 2840
    sd_volume= 297



  cit_initial_logic <- function(data, threshold) {
   # positive <- length(data[data$cit >= 100 | data$asa_adjusted >= threshold,])
    positive <- length(data[data$asa_adjusted >= threshold,])
    return(positive)
    }  

  citinitial <- data.frame(sample = double(), volume = double(), threshold= double(),
			    initial_positive = double(), stringsAsFactors = FALSE)
  c <- 0
  for (s in 1:1000) {
    v <- rnorm(n=1, mean = mean_volume, sd = sd_volume) ## sample volume$date
     data_sample <- sample_n(adjusted_merge_int, v, replace = FALSE)
      for (t in seq(from = start, to = end, by = 1)) {
	c <- c + 1
	p <- cit_initial_logic(data=data_sample, threshold=t)
	citinitial[c,] <- list(sample = s, volume=v, threshold = t, initial_positive =p)
      }
    }

#+end_src

#+RESULTS:


#+begin_src R :session *R* :results output latex :exports results :tangle yes
  citinitial %>%
    group_by(threshold) %>%
    summarise( min = min(initial_positive),
	      p025 = quantile(initial_positive,probs = c(0.025), type = 8, na.rm = TRUE),
	      median = median(initial_positive, na.rm = TRUE),
	      p975 = quantile(initial_positive,probs = c(0.975), type = 8, na.rm = TRUE),
	      max = max(initial_positive)) %>%
    as.data.frame() %>%
					# write.csv(,file = "../data/tyr1_simulation.csv") 
    stargazer(summary = FALSE, rownames = FALSE,
	      title="Output of Cit initial logic simulation for weekly volumes" ,
		label = "tab:sim")

#+end_src

#+RESULTS:
#+begin_export latex
% Table created by stargazer v.5.2.3 by Marek Hlavac, Social Policy Institute. E-mail: marek.hlavac at gmail.com
% Date and time: Tue, Sep 23, 2025 - 06:14:40 PM
\begin{table}[!htbp] \centering 
  \caption{Output of Cit initial logic simulation for weekly volumes} 
  \label{tab:sim} 
\begin{tabular}{@{\extracolsep{5pt}} cccccc} 
\\[-1.8ex]\hline 
\hline \\[-1.8ex] 
threshold & min & p025 & median & p975 & max \\ 
\hline \\[-1.8ex] 
$10$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$11$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$12$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$13$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$14$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$15$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$16$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$17$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$18$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$19$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$20$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$21$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$22$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$23$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$24$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$25$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$26$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$27$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$28$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$29$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
$30$ & $20$ & $20$ & $20$ & $20$ & $20$ \\ 
\hline \\[-1.8ex] 
\end{tabular} 
\end{table}
#+end_export
